<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"51f47fe0fcc8b3d06a9136741153a99103aaa0947abbb6b696cacd85c6efc990","plan_job_ref":"Job Create PR TF Plan comment #3 at https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13488172075","plan_hash":"bd22137872fe0a98ac3d934035484fc8e5c15cc4e03c5462f8d293627a640b4d","plan_text_format":"diff","version":"1.46.1","plan_out_hash":"d9bbda3426dbd08d0a628e1b7adf32e57e74cca66a9501c4b08494c341c16235","closed":true} -->
Terraform plan in __./tf_restore__
With backend config: `resource_group_name=ClauseFabric storage_account_name=tfsamsfabrictfstate container_name=tfstate key=terraform-msfabric-restore-demo.tfstate`<details open><summary>With variables</summary>

```hcl
admin_user        = (sensitive value)
admin_user2       = (sensitive value)
azeventhub_saskey = (sensitive value)
client_id         = (sensitive value)
client_secret     = (sensitive value)
tenant_id         = (sensitive value)
```
</details>
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # fabric_eventhouse.kql_demo_restore will be created
+   resource "fabric_eventhouse" "kql_demo_restore" {
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "eh-sqlkonferenz2025-restored"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_eventstream.kql_demo_es_restore will be created
+   resource "fabric_eventstream" "kql_demo_es_restore" {
+       definition                = {
+           "eventstream.json" = {
+               source                = "../item-templates/eventstream.json.tmpl"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "ConnId"    = (known after apply)
+                   "KqlDbId"   = (known after apply)
+                   "KqlDbName" = "kql-db-01-sqlkonferenz2025-restored"
+                   "WsId"      = "1da529f7-1dcd-4fe7-a9b6-327a9c5869d1"
                }
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-es-sqlkonferenz2025-restored"
+       format                    = "Default"
+       id                        = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_dashboard.kql_demo_dash_restore will be created
+   resource "fabric_kql_dashboard" "kql_demo_dash_restore" {
+       definition                = {
+           "RealTimeDashboard.json" = {
+               source                = "../item-templates/RealTimeDashboard_downloaded.json"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "KqlDbId"     = (known after apply)
+                   "QuerySvcUri" = (known after apply)
+                   "WsId"        = "1da529f7-1dcd-4fe7-a9b6-327a9c5869d1"
                }
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-dash-sqlkonferenz2025-restored"
+       format                    = "Default"
+       id                        = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_database.kql_demo_db_1_restore will be created
+   resource "fabric_kql_database" "kql_demo_db_1_restore" {
+       definition                = {
+           "DatabaseProperties.json" = {
+               source                = "../item-templates/DatabaseProperties_01.json.tmpl"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "KqlEhId" = (known after apply)
                }
            },
+           "DatabaseSchema.kql" = {
+               source                = "../item-templates/DatabaseSchema_01.kql"
+               source_content_sha256 = "4507ca977dab0e1aa16f205c0d92dafebc96e03e50a0d582a6b3f0120cbc300c"
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-db-01-sqlkonferenz2025-restored"
+       format                    = "Default"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_database.kql_demo_db_2_restore will be created
+   resource "fabric_kql_database" "kql_demo_db_2_restore" {
+       definition                = {
+           "DatabaseProperties.json" = {
+               source                = "../item-templates/DatabaseProperties_01.json.tmpl"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "KqlEhId" = (known after apply)
                }
            },
+           "DatabaseSchema.kql" = {
+               source                = "../item-templates/DatabaseSchema_02.kql"
+               source_content_sha256 = "6ceb64df2ef8eb9662dbf7723d3148aac56cc11a273e8b047dfa4fbc217f6710"
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-db-02-sqlkonferenz2025-restored"
+       format                    = "Default"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # module.ws_conn_eventhub.restapi_object.connection_role_assignment["0"] will be created
+   resource "restapi_object" "connection_role_assignment" {
+       api_data        = (known after apply)
+       api_response    = (known after apply)
+       create_response = (known after apply)
+       data            = jsonencode(
            {
+               principal = {
+                   id   = "c1d79f51-4298-4487-b11e-9df13fd2fc3b"
+                   type = "Group"
                }
+               role      = "Owner"
            }
        )
+       destroy_path    = (known after apply)
+       id              = (known after apply)
+       path            = (known after apply)
+       read_path       = (known after apply)
+       update_path     = (known after apply)
    }

  # module.ws_conn_eventhub.restapi_object.connection_role_assignment["1"] will be created
+   resource "restapi_object" "connection_role_assignment" {
+       api_data        = (known after apply)
+       api_response    = (known after apply)
+       create_response = (known after apply)
+       data            = jsonencode(
            {
+               principal = {
+                   id   = "5b2864ad-58d8-4442-a3e9-1c3d1a5cdca6"
+                   type = "User"
                }
+               role      = "Owner"
            }
        )
+       destroy_path    = (known after apply)
+       id              = (known after apply)
+       path            = (known after apply)
+       read_path       = (known after apply)
+       update_path     = (known after apply)
    }

  # module.ws_conn_eventhub.restapi_object.fabric_connection will be created
+   resource "restapi_object" "fabric_connection" {
+       api_data        = (known after apply)
+       api_response    = (known after apply)
+       create_response = (known after apply)
+       data            = (sensitive value)
+       debug           = true
+       destroy_path    = "/connections/{id}"
+       id              = (known after apply)
+       path            = "/connections"
+       read_path       = "/connections/{id}"
+       update_method   = "PATCH"
+       update_path     = "/connections/{id}"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: 'Eventstream' preview mode

  with fabric_eventstream.kql_demo_es_restore,
  on kql-resources-restore.tf line 51, in resource "fabric_eventstream" "kql_demo_es_restore":
  51: resource "fabric_eventstream" "kql_demo_es_restore" {

The behavior of 'Eventstream' may change in future releases without notice or
backward compatibility.

(and one more similar warning elsewhere)

Warning: Preview mode enabled

  with provider["registry.terraform.io/microsoft/fabric"],
  on provider.tf line 20, in provider "fabric":
  20: provider "fabric" {

Features available in preview mode are not yet generally available and may
change without notice include breaking changes. Production use is not
recommended. Use at your own risk!
```
</details>

:white_check_mark: Plan applied in [Terraform CD - Restore #2](https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13488197729)